import test
# print(test.new_meal("test", ("id", "num"), (5, "тралинни")))
# print(test.edit_meal("test", ("id", ), (6, 1)))
#метод для поисковика, на вход подается введенная строка, возвращается строка с наменованием блюда
# print(test.serch_meals(input()))
#метод для фильтрации
# print( test.take_meal())
print(test.edit_meal("meals", ["recipeSteps"], ["Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта._000000000.jpg/ Бананы очистите от кожуры и нарежьте кружочками или дольками._000000001/ Апельсины очистите от кожуры и белой части, разделите на дольки._000000002/ Груши помойте, обсушите и нарежьте кубиками._000000003/ В большой миске аккуратно смешайте все нарезанные фрукты._000000004/ По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов._000000005/ Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа._000000006/ Фруктовый салат хорошо дополняется орехами или ягодами._000000007/ Можно посыпать сверху небольшим количеством мяты или базилика для аромата._000000008/ Распределите фруктовый салат по порционным тарелкам и подавайте._000000009", 0]))

#метод для получения блюд главной страницы
#метод для получения полной информации о блюде
#метод для  рулетки
#метод добавления блюда
#метод редактирования блюда
#метод получения полной информации о пользователе
#метод получения краткой информации о пользователе
