def massiv_recipe(aaa):
    if aaa == 0:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 0',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 0 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 1:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 1',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 1 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 2:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 2',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 2 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 3:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 3',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 3 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 4:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 4',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 4 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 5:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 5',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 5 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 6:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 6',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 6 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 7:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 7',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 7 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 8:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 8',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 8 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    elif aaa == 9:
        recipe_info = {
            "mealRecipe": {
                'Название': 'Фруктовый салат с индексом 9',
                'Описание': 'Фруктовый салат: свежий и простой способ получить порцию витаминов и освежающей энергии. Сочные яблоки, бананы, апельсины и груши сочетаются в легкое угощение, приносящее пользу вашему здоровью. Идеально подходит в качестве быстрого и питательного перекуса в любое время дня!',
                'Ингредиенты': [
                    'Яблоки 200г',
                    'Бананы 100г',
                    'Апельсины 100г',
                    'Груши 50г'
                ],
                'Шаги': [
                    {'text': 'Индекс 9 Яблоки помойте, обсушите и удалите сердцевину. Можно оставить кожуру, если она хорошо вымыта.',
                     'image': 'ссылка_на_изображение_шага_1'},
                    {'text': 'Бананы очистите от кожуры и нарежьте кружочками или дольками.',
                     'image': 'ссылка_на_изображение_шага_2'},
                    {'text': 'Апельсины очистите от кожуры и белой части, разделите на дольки.',
                     'image': 'ссылка_на_изображение_шага_3'},
                    {'text': 'Груши помойте, обсушите и нарежьте кубиками.',
                     'image': 'ссылка_на_изображение_шага_4'},
                    {'text': 'В большой миске аккуратно смешайте все нарезанные фрукты.',
                     'image': 'ссылка_на_изображение_шага_5'},
                    {'text': 'По желанию можно добавить сок лимона или апельсина для сохранения свежести фруктов.',
                     'image': 'ссылка_на_изображение_шага_6'},
                    {'text': 'Если вы предпочитаете сладкий вкус, можно добавить немного меда или кленового сиропа.',
                     'image': 'ссылка_на_изображение_шага_7'},
                    {'text': 'Фруктовый салат хорошо дополняется орехами или ягодами.',
                     'image': 'ссылка_на_изображение_шага_8'},
                    {'text': 'Можно посыпать сверху небольшим количеством мяты или базилика для аромата.',
                     'image': 'ссылка_на_изображение_шага_9'},
                    {'text': 'Распределите фруктовый салат по порционным тарелкам и подавайте.',
                     'image': 'ссылка_на_изображение_шага_10'}
                ],
                "totalWeight": "450 г",
                "calories": "200 ккал",
                "mealTime": ["Утро", "Вечер"],
                "containsMeat": 0,
                "seafood": 0,
                "healthy": 1,
                "drink": 0,
                "difficulty": "Легкий"
            }
        }
    return recipe_info
